In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
train = pd.read_csv('../AVblackFriday/train.csv')
test = pd.read_csv('../AVblackFriday/test.csv')
yproductID = test['Product_ID']
yuserID = test['User_ID']

In [2]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [3]:
train.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.500680e+05,550068.000000,550068.000000,550068.000000,376430.000000,166821.000000,550068.000000
mean,1.003029e+06,8.076707,0.409653,5.404270,9.842329,12.668243,9263.968713
std,1.727592e+03,6.522660,0.491770,3.936211,5.086590,4.125338,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001516e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003077e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [4]:
train['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [5]:
train['Product_ID'].nunique()

3631

In [6]:
train['City_Category'].value_counts()

B    231173
C    171175
A    147720
Name: City_Category, dtype: int64

In [7]:
train['Stay_In_Current_City_Years'].value_counts()

1     193821
2     101838
3      95285
4+     84726
0      74398
Name: Stay_In_Current_City_Years, dtype: int64

In [8]:
train['Marital_Status'].unique()

array([0, 1], dtype=int64)

In [9]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [10]:
test.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
dtype: object

# Converting Categorical variables into labels

In [11]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()
def PreProcess(df):
    df['productID'] = lb.fit_transform(df['Product_ID'])
    df['gender'] = lb.fit_transform(df['Gender'])
    df['age'] = lb.fit_transform(df['Age'])
    df['city'] = lb.fit_transform(df['City_Category'])
    df['cityYears'] = lb.fit_transform(df['Stay_In_Current_City_Years'])

In [12]:
PreProcess(train)
train = train.drop(['Product_ID','Gender','Age','City_Category','Stay_In_Current_City_Years'], 1)
train.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
Purchase                int64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

In [13]:
PreProcess(test)
test = test.drop(['Product_ID','Gender','Age','City_Category','Stay_In_Current_City_Years'], 1)
test.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

# Taking up Product_Categories

In [14]:
train.apply(lambda x: sum(x.isnull()))

User_ID                    0
Occupation                 0
Marital_Status             0
Product_Category_1         0
Product_Category_2    173638
Product_Category_3    383247
Purchase                   0
productID                  0
gender                     0
age                        0
city                       0
cityYears                  0
dtype: int64

In [15]:
#import numpy as np
#train['Product_Category_2'] = train['Product_Category_2'].astype(np.int64)

In [16]:
train[['Product_Category_1','Product_Category_2',"Product_Category_3"]].sample(10)

        Product_Category_1  Product_Category_2  Product_Category_3
30278                    1                 5.0                 9.0
292369                   5                15.0                 NaN
41377                   13                 NaN                 NaN
289433                   5                14.0                 NaN
28306                   10                16.0                 NaN
482770                   1                 8.0                17.0
236714                   1                 5.0                18.0
292738                   5                 NaN                 NaN
519485                   1                 2.0                15.0
524184                   5                 8.0                 NaN

In [17]:
train[train['Product_Category_2'].isnull()].head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,NaN,NaN,8370,672,0,0,0,2
2,1000001,10,0,12,NaN,NaN,1422,852,0,0,0,2
4,1000002,16,0,8,NaN,NaN,7969,2734,1,6,2,4
9,1000005,20,1,8,NaN,NaN,7871,2631,1,2,0,1
11,1000005,20,1,8,NaN,NaN,3957,140,1,2,0,1
12,1000005,20,1,8,NaN,NaN,6073,307,1,2,0,1
21,1000008,12,1,8,NaN,NaN,9872,1469,1,2,2,4
22,1000008,12,1,8,NaN,NaN,9743,2029,1,2,2,4
23,1000008,12,1,8,NaN,NaN,5982,2036,1,2,2,4
26,1000009,17,0,8,NaN,NaN,5887,391,1,2,2,0

In [18]:
train['productID'][train['Product_Category_2'].isnull()].unique()

array([ 672,  852, 2734, ..., 3560, 3566, 3565], dtype=int64)

In [19]:
len(train['productID'][train['Product_Category_2'].isnull()].unique())
#indicates that

1828

In [20]:
#find user_ID is different, productID is same and product_Category_2 is NaN
#train['Product_Category_2'][train['productID'] ==]
train2 = train
len(train[['User_ID', 'productID', 'Product_Category_2']][train['productID'] == train2['productID']][train['User_ID'] != train2['User_ID']][train['Product_Category_2'].isnull()])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

0

In [21]:
train[train['Product_Category_3'].isnull()].head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,NaN,NaN,8370,672,0,0,0,2
2,1000001,10,0,12,NaN,NaN,1422,852,0,0,0,2
3,1000001,10,0,12,14.0,NaN,1057,828,0,0,0,2
4,1000002,16,0,8,NaN,NaN,7969,2734,1,6,2,4
5,1000003,15,0,1,2.0,NaN,15227,1831,1,2,0,3
7,1000004,7,1,1,15.0,NaN,15854,3320,1,4,1,2
8,1000004,7,1,1,16.0,NaN,15686,3604,1,4,1,2
9,1000005,20,1,8,NaN,NaN,7871,2631,1,2,0,1
10,1000005,20,1,5,11.0,NaN,5254,2398,1,2,0,1
11,1000005,20,1,8,NaN,NaN,3957,140,1,2,0,1

In [22]:
len(train['User_ID'][train['Product_Category_3'].isnull()])

383247

In [23]:
len(train[train['Product_Category_3'].isnull()][train['Product_Category_2'].isnull()])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

173638

In [24]:
train[['Product_Category_3']][train['Product_Category_2'].isnull()].sum()
#this proves all rows where Product_Category_2 is null, Product_Category_3 is also null

Product_Category_3    0.0
dtype: float64

In [25]:
train.shape

(550068, 12)

**1. Replacing all NaNs**

In [26]:
Xtrain= train.copy()

In [27]:
Xtrain.shape

(550068, 12)

In [28]:
#Xtrain.fillna(-999, inplace=True)

In [29]:
Xtrain.head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,NaN,NaN,8370,672,0,0,0,2
1,1000001,10,0,1,6.0,14.0,15200,2376,0,0,0,2
2,1000001,10,0,12,NaN,NaN,1422,852,0,0,0,2
3,1000001,10,0,12,14.0,NaN,1057,828,0,0,0,2
4,1000002,16,0,8,NaN,NaN,7969,2734,1,6,2,4
5,1000003,15,0,1,2.0,NaN,15227,1831,1,2,0,3
6,1000004,7,1,1,8.0,17.0,19215,1745,1,4,1,2
7,1000004,7,1,1,15.0,NaN,15854,3320,1,4,1,2
8,1000004,7,1,1,16.0,NaN,15686,3604,1,4,1,2
9,1000005,20,1,8,NaN,NaN,7871,2631,1,2,0,1

In [30]:
Xtrain.apply(lambda x: sum(x.isnull()))

User_ID                    0
Occupation                 0
Marital_Status             0
Product_Category_1         0
Product_Category_2    173638
Product_Category_3    383247
Purchase                   0
productID                  0
gender                     0
age                        0
city                       0
cityYears                  0
dtype: int64

**Working in test dataset**

In [31]:
Xtest = test.copy()

In [32]:
#Xtest.fillna(-999, inplace=True)

In [33]:
Xtest.shape

(233599, 11)

In [34]:
Xtest.apply(lambda x: sum(x.isnull()))

User_ID                    0
Occupation                 0
Marital_Status             0
Product_Category_1         0
Product_Category_2     72344
Product_Category_3    162562
productID                  0
gender                     0
age                        0
city                       0
cityYears                  0
dtype: int64

# Model training

In [35]:
ytrain = Xtrain['Purchase']
print(ytrain.shape)
Xtrain = Xtrain.iloc[:, Xtrain.columns != 'Purchase']
print(Xtrain.shape)

(550068,)
(550068, 11)

In [36]:
from sklearn.utils import shuffle
Xtrain = shuffle(Xtrain)
Xtest = shuffle(Xtest)

In [37]:
Xtrain.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

In [38]:
import xgboost as xgb
xgtrain = xgb.DMatrix(Xtrain, label=ytrain, missing = np.nan)
xgtest = xgb.DMatrix(Xtest, missing = np.nan)

In [42]:
params = {}
params['objective'] = 'reg:linear'
params['eta'] = 0.02
params['seed'] = 0
params['eval_matric'] = 'mae'
num_rounds = 900
%time model = xgb.train(params, xgtrain, num_rounds)

Wall time: 3min 39s

In [43]:
%time ypred = model.predict(xgtest)

Wall time: 3.87 s

In [50]:
cv_results = xgb.cv(params, xgtrain, num_rounds, early_stopping_rounds = 10)
cv_results.min

     test-rmse-mean  test-rmse-std  train-rmse-mean  train-rmse-std
0      10375.225911       9.869420     10375.176758        4.827490
1      10216.764323       9.949584     10216.664063        4.763637
2      10062.228516      10.028991     10062.074219        4.701431
3       9911.545573      10.096674      9911.335937        4.640431
4       9764.642253      10.169393      9764.375000        4.583801
5       9621.436849      10.233868      9621.117513        4.527477
6       9481.870443      10.302607      9481.495442        4.476585
7       9345.871419      10.368036      9345.434896        4.426112
8       9213.367188      10.426092      9212.870117        4.377086
9       9084.284180      10.487173      9083.732422        4.332309
10      8958.565104      10.533316      8957.949870        4.292509
11      8836.144206      10.589271      8835.463216        4.253219
12      8716.952474      10.639522      8716.203125        4.212576
13      8600.927734      10.694366      8600.109049        4.178220
14      8487.993490      10.744362      8487.114583        4.141665
15      8378.107422      10.788289      8377.156250        4.111029
16      8271.196940      10.825078      8270.177083        4.079270
17      8167.208171      10.868598      8166.110026        4.050772
18      8066.069987      10.899204      8064.900391        4.025097
19      7967.724447      10.933817      7966.486003        3.999687
20      7872.116211      10.963265      7870.808268        3.976008
21      7779.189616      10.988214      7777.808919        3.953332
22      7688.883464      11.011168      7687.429687        3.933875
23      7601.140137      11.032362      7599.616048        3.916950
24      7515.906901      11.048666      7514.313477        3.897232
25      7433.135905      11.061696      7431.462891        3.886030
26      7352.760905      11.076070      7351.009440        3.870939
27      7274.728678      11.086890      7272.903646        3.863167
28      7198.994792      11.103977      7197.089844        3.853350
29      7125.498698      11.117214      7123.519857        3.843176
..              ...            ...              ...             ...
245     5025.044434       8.358536      5008.625651        3.528291
246     5025.033854       8.361201      5008.548991        3.511483
247     5025.024902       8.364264      5008.475423        3.504385
248     5025.020182       8.361393      5008.403971        3.499711
249     5025.015462       8.364382      5008.331217        3.510551
250     5025.003743       8.363571      5008.268066        3.499458
251     5024.996582       8.366182      5008.206055        3.509438
252     5024.988444       8.363884      5008.158040        3.511992
253     5024.981934       8.360731      5008.104330        3.516129
254     5024.975749       8.358887      5008.035970        3.511611
255     5024.970052       8.357792      5007.971842        3.504421
256     5024.964030       8.358659      5007.907064        3.498299
257     5024.957031       8.357667      5007.855632        3.504450
258     5024.949870       8.355197      5007.790853        3.497566
259     5024.948893       8.347934      5007.728190        3.486575
260     5024.948080       8.350692      5007.661784        3.485238
261     5024.942545       8.348628      5007.604655        3.481558
262     5024.938802       8.348032      5007.536947        3.494626
263     5024.937500       8.350665      5007.493489        3.488505
264     5024.931478       8.347725      5007.440592        3.497001
265     5024.930176       8.344358      5007.375488        3.511994
266     5024.926920       8.342785      5007.298665        3.516271
267     5024.927897       8.346527      5007.229492        3.516328
268     5024.928548       8.346743      5007.175293        3.525301
269     5024.926270       8.342416      5007.097819        3.514742
270     5024.921061       8.342398      5007.036133        3.512051
271     5024.921549       8.341778      5006.982910        3.497738
272     5024.922038       8.338481      5006.924479        3.489222
273     5024.921387       8.332172      5006.868164        3.477932
274     5024.918620       8.330078      5006.812500        3.472260

[275 rows x 4 columns]

In [54]:
cv_results.min()

test-rmse-mean     5024.918620
test-rmse-std         8.330078
train-rmse-mean    5006.812500
train-rmse-std        3.472260
dtype: float64

In [51]:
output = pd.DataFrame(columns=['User_ID', 'Product_ID', 'Purchase'])
output.dtypes

User_ID       object
Product_ID    object
Purchase      object
dtype: object

In [52]:
output['User_ID'] = yuserID
output['Product_ID'] = yproductID 
output['Purchase'] = ypred

In [53]:
output.to_csv('m3.csv', index=False)